-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Εξυπηρετητής: 127.0.0.1
-- Χρόνος δημιουργίας: 29 Νοε 2023 στις 11:20:58
-- Έκδοση διακομιστή: 10.4.28-MariaDB
-- Έκδοση PHP: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Βάση δεδομένων: `board_game`
--

DELIMITER $$
--
-- Διαδικασίες
--
CREATE DEFINER=`root`@`localhost` PROCEDURE `clean_board` ()   BEGIN
	REPLACE INTO board SELECT * FROM board_empty;
END$$

CREATE DEFINER=`root`@`localhost` PROCEDURE `move_piece` (`x1` TINYINT, `y1` TINYINT, `x2` TINYINT, `y2` TINYINT)   BEGIN
	declare  p, p_color char;
	
	select  piece, piece_color into p, p_color FROM `board` WHERE X=x1 AND Y=y1;
	
	update board
	set piece=p, piece_color=p_color
	where x=x2 and y=y2;
	
	UPDATE board
	SET piece=null,piece_color=null
	WHERE X=x1 AND Y=y1;
	update game_status set p_turn=if(p_color='P','R','P');
	
    END$$

DELIMITER ;

-- --------------------------------------------------------

--
-- Δομή πίνακα για τον πίνακα `board`
--

CREATE TABLE `board` (
  `x` tinyint(1) NOT NULL,
  `y` tinyint(1) NOT NULL,
  `b_color` enum('R','P','W') NOT NULL,
  `piece_color` enum('R','P') DEFAULT NULL,
  `piece` enum('K1','K2') DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Άδειασμα δεδομένων του πίνακα `board`
--

INSERT INTO `board` (`x`, `y`, `b_color`, `piece_color`, `piece`) VALUES
(1, 1, 'R', '', ''),
(1, 2, 'R', '', ''),
(1, 3, 'R', '', ''),
(1, 4, 'R', '', ''),
(1, 5, 'R', '', ''),
(1, 6, 'W', '', ''),
(1, 7, 'W', '', ''),
(1, 8, 'W', '', ''),
(1, 9, 'W', '', ''),
(1, 10, 'W', '', ''),
(1, 11, 'W', '', ''),
(1, 12, 'W', '', ''),
(1, 13, 'W', '', ''),
(2, 1, 'R', '', ''),
(2, 2, 'W', '', ''),
(2, 3, 'W', '', ''),
(2, 4, 'W', '', ''),
(2, 5, 'R', '', ''),
(2, 6, 'W', '', ''),
(2, 7, 'W', '', ''),
(2, 8, 'W', '', ''),
(2, 9, 'W', '', ''),
(2, 10, 'W', '', ''),
(2, 11, 'W', '', ''),
(2, 12, 'W', '', ''),
(2, 13, 'W', '', ''),
(3, 1, 'R', '', ''),
(3, 2, 'W', 'R', 'K2'),
(3, 3, 'W', '', ''),
(3, 4, 'W', '', ''),
(3, 5, 'R', '', ''),
(3, 6, 'W', '', ''),
(3, 7, 'W', '', ''),
(3, 8, 'W', '', ''),
(3, 9, 'W', '', ''),
(3, 10, 'W', '', ''),
(3, 11, 'W', '', ''),
(3, 12, 'W', '', ''),
(3, 13, 'W', '', ''),
(4, 1, 'R', '', ''),
(4, 2, 'W', 'R', 'K1'),
(4, 3, 'W', '', ''),
(4, 4, 'W', '', ''),
(4, 5, 'R', '', ''),
(4, 6, 'W', '', ''),
(4, 7, 'W', '', ''),
(4, 8, 'W', '', ''),
(4, 9, 'W', '', ''),
(4, 10, 'W', '', ''),
(4, 11, 'W', '', ''),
(4, 12, 'W', '', ''),
(4, 13, 'W', '', ''),
(5, 1, 'R', '', ''),
(5, 2, 'R', '', ''),
(5, 3, 'R', '', ''),
(5, 4, 'R', '', ''),
(5, 5, 'R', '', ''),
(5, 6, 'W', '', ''),
(5, 7, 'W', '', ''),
(5, 8, 'W', '', ''),
(5, 9, 'W', '', ''),
(5, 10, 'W', '', ''),
(5, 11, 'W', '', ''),
(5, 12, 'W', '', ''),
(5, 13, 'W', '', ''),
(6, 1, 'W', '', ''),
(6, 2, 'R', '', ''),
(6, 3, 'W', '', ''),
(6, 4, 'W', '', ''),
(6, 5, 'W', '', ''),
(6, 6, 'W', '', ''),
(6, 7, 'W', '', ''),
(6, 8, 'W', '', ''),
(6, 9, 'W', '', ''),
(6, 10, 'W', '', ''),
(6, 11, 'W', '', ''),
(6, 12, 'W', '', ''),
(6, 13, 'W', '', ''),
(7, 1, 'W', '', ''),
(7, 2, 'W', '', ''),
(7, 3, 'W', '', ''),
(7, 4, 'W', '', ''),
(7, 5, 'R', '', ''),
(7, 6, 'W', '', ''),
(7, 7, 'W', '', ''),
(7, 8, 'W', '', ''),
(7, 9, 'P', '', ''),
(7, 10, 'P', '', ''),
(7, 11, 'W', '', ''),
(7, 12, 'W', '', ''),
(7, 13, 'W', '', ''),
(8, 1, 'W', '', ''),
(8, 2, 'W', '', ''),
(8, 3, 'W', '', ''),
(8, 4, 'W', '', ''),
(8, 5, 'W', '', ''),
(8, 6, 'W', '', ''),
(8, 7, 'W', '', ''),
(8, 8, 'W', '', ''),
(8, 9, 'W', '', ''),
(8, 10, 'W', '', ''),
(8, 11, 'W', '', ''),
(8, 12, 'P', '', ''),
(8, 13, 'W', '', ''),
(9, 1, 'W', '', ''),
(9, 2, 'W', '', ''),
(9, 3, 'W', '', ''),
(9, 4, 'W', '', ''),
(9, 5, 'W', '', ''),
(9, 6, 'W', '', ''),
(9, 7, 'W', '', ''),
(9, 8, 'W', '', ''),
(9, 9, 'P', '', ''),
(9, 10, 'P', '', ''),
(9, 11, 'P', '', ''),
(9, 12, 'P', '', ''),
(9, 13, 'P', '', ''),
(10, 1, 'W', '', ''),
(10, 2, 'W', '', ''),
(10, 3, 'W', '', ''),
(10, 4, 'W', '', ''),
(10, 5, 'W', '', ''),
(10, 6, 'W', '', ''),
(10, 7, 'W', '', ''),
(10, 8, 'W', '', ''),
(10, 9, 'P', '', ''),
(10, 10, 'W', '', ''),
(10, 11, 'W', '', ''),
(10, 12, 'W', 'P', 'K1'),
(10, 13, 'P', '', ''),
(11, 1, 'W', '', ''),
(11, 2, 'W', '', ''),
(11, 3, 'W', '', ''),
(11, 4, 'W', '', ''),
(11, 5, 'W', '', ''),
(11, 6, 'W', '', ''),
(11, 7, 'W', '', ''),
(11, 8, 'W', '', ''),
(11, 9, 'P', '', ''),
(11, 10, 'W', '', ''),
(11, 11, 'W', '', ''),
(11, 12, 'W', 'P', 'K2'),
(11, 13, 'P', '', ''),
(12, 1, 'W', '', ''),
(12, 2, 'W', '', ''),
(12, 3, 'W', '', ''),
(12, 4, 'W', '', ''),
(12, 5, 'W', '', ''),
(12, 6, 'W', '', ''),
(12, 7, 'W', '', ''),
(12, 8, 'W', '', ''),
(12, 9, 'P', '', ''),
(12, 10, 'W', '', ''),
(12, 11, 'W', '', ''),
(12, 12, 'W', '', ''),
(12, 13, 'P', '', ''),
(13, 1, 'W', '', ''),
(13, 2, 'W', '', ''),
(13, 3, 'W', '', ''),
(13, 4, 'W', '', ''),
(13, 5, 'W', '', ''),
(13, 6, 'W', '', ''),
(13, 7, 'W', '', ''),
(13, 8, 'W', '', ''),
(13, 9, 'P', '', ''),
(13, 10, 'P', '', ''),
(13, 11, 'P', '', ''),
(13, 12, 'P', '', ''),
(13, 13, 'P', '', '');

-- --------------------------------------------------------

--
-- Δομή πίνακα για τον πίνακα `board_empty`
--

CREATE TABLE `board_empty` (
  `x` tinyint(1) NOT NULL,
  `y` tinyint(1) NOT NULL,
  `b_color` enum('R','P','W') NOT NULL,
  `piece_color` enum('R','P') DEFAULT NULL,
  `piece` enum('K1','K2') DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Άδειασμα δεδομένων του πίνακα `board_empty`
--

INSERT INTO `board_empty` (`x`, `y`, `b_color`, `piece_color`, `piece`) VALUES
(1, 1, 'R', '', ''),
(1, 2, 'R', '', ''),
(1, 3, 'R', '', ''),
(1, 4, 'R', '', ''),
(1, 5, 'R', '', ''),
(1, 6, 'W', '', ''),
(1, 7, 'W', '', ''),
(1, 8, 'W', '', ''),
(1, 9, 'W', '', ''),
(1, 10, 'W', '', ''),
(1, 11, 'W', '', ''),
(1, 12, 'W', '', ''),
(1, 13, 'W', '', ''),
(2, 1, 'R', '', ''),
(2, 2, 'W', '', ''),
(2, 3, 'W', '', ''),
(2, 4, 'W', '', ''),
(2, 5, 'R', '', ''),
(2, 6, 'W', '', ''),
(2, 7, 'W', '', ''),
(2, 8, 'W', '', ''),
(2, 9, 'W', '', ''),
(2, 10, 'W', '', ''),
(2, 11, 'W', '', ''),
(2, 12, 'W', '', ''),
(2, 13, 'W', '', ''),
(3, 1, 'R', '', ''),
(3, 2, 'W', 'R', 'K2'),
(3, 3, 'W', '', ''),
(3, 4, 'W', '', ''),
(3, 5, 'R', '', ''),
(3, 6, 'W', '', ''),
(3, 7, 'W', '', ''),
(3, 8, 'W', '', ''),
(3, 9, 'W', '', ''),
(3, 10, 'W', '', ''),
(3, 11, 'W', '', ''),
(3, 12, 'W', '', ''),
(3, 13, 'W', '', ''),
(4, 1, 'R', '', ''),
(4, 2, 'W', 'R', 'K1'),
(4, 3, 'W', '', ''),
(4, 4, 'W', '', ''),
(4, 5, 'R', '', ''),
(4, 6, 'W', '', ''),
(4, 7, 'W', '', ''),
(4, 8, 'W', '', ''),
(4, 9, 'W', '', ''),
(4, 10, 'W', '', ''),
(4, 11, 'W', '', ''),
(4, 12, 'W', '', ''),
(4, 13, 'W', '', ''),
(5, 1, 'R', '', ''),
(5, 2, 'R', '', ''),
(5, 3, 'R', '', ''),
(5, 4, 'R', '', ''),
(5, 5, 'R', '', ''),
(5, 6, 'W', '', ''),
(5, 7, 'W', '', ''),
(5, 8, 'W', '', ''),
(5, 9, 'W', '', ''),
(5, 10, 'W', '', ''),
(5, 11, 'W', '', ''),
(5, 12, 'W', '', ''),
(5, 13, 'W', '', ''),
(6, 1, 'W', '', ''),
(6, 2, 'R', '', ''),
(6, 3, 'W', '', ''),
(6, 4, 'W', '', ''),
(6, 5, 'W', '', ''),
(6, 6, 'W', '', ''),
(6, 7, 'W', '', ''),
(6, 8, 'W', '', ''),
(6, 9, 'W', '', ''),
(6, 10, 'W', '', ''),
(6, 11, 'W', '', ''),
(6, 12, 'W', '', ''),
(6, 13, 'W', '', ''),
(7, 1, 'W', '', ''),
(7, 2, 'W', '', ''),
(7, 3, 'W', '', ''),
(7, 4, 'W', '', ''),
(7, 5, 'R', '', ''),
(7, 6, 'W', '', ''),
(7, 7, 'W', '', ''),
(7, 8, 'W', '', ''),
(7, 9, 'P', '', ''),
(7, 10, 'P', '', ''),
(7, 11, 'W', '', ''),
(7, 12, 'W', '', ''),
(7, 13, 'W', '', ''),
(8, 1, 'W', '', ''),
(8, 2, 'W', '', ''),
(8, 3, 'W', '', ''),
(8, 4, 'W', '', ''),
(8, 5, 'W', '', ''),
(8, 6, 'W', '', ''),
(8, 7, 'W', '', ''),
(8, 8, 'W', '', ''),
(8, 9, 'W', '', ''),
(8, 10, 'W', '', ''),
(8, 11, 'W', '', ''),
(8, 12, 'P', '', ''),
(8, 13, 'W', '', ''),
(9, 1, 'W', '', ''),
(9, 2, 'W', '', ''),
(9, 3, 'W', '', ''),
(9, 4, 'W', '', ''),
(9, 5, 'W', '', ''),
(9, 6, 'W', '', ''),
(9, 7, 'W', '', ''),
(9, 8, 'W', '', ''),
(9, 9, 'P', '', ''),
(9, 10, 'P', '', ''),
(9, 11, 'P', '', ''),
(9, 12, 'P', '', ''),
(9, 13, 'P', '', ''),
(10, 1, 'W', '', ''),
(10, 2, 'W', '', ''),
(10, 3, 'W', '', ''),
(10, 4, 'W', '', ''),
(10, 5, 'W', '', ''),
(10, 6, 'W', '', ''),
(10, 7, 'W', '', ''),
(10, 8, 'W', '', ''),
(10, 9, 'P', '', ''),
(10, 10, 'W', '', ''),
(10, 11, 'W', '', ''),
(10, 12, 'W', 'P', 'K1'),
(10, 13, 'P', '', ''),
(11, 1, 'W', '', ''),
(11, 2, 'W', '', ''),
(11, 3, 'W', '', ''),
(11, 4, 'W', '', ''),
(11, 5, 'W', '', ''),
(11, 6, 'W', '', ''),
(11, 7, 'W', '', ''),
(11, 8, 'W', '', ''),
(11, 9, 'P', '', ''),
(11, 10, 'W', '', ''),
(11, 11, 'W', '', ''),
(11, 12, 'W', 'P', 'K2'),
(11, 13, 'P', '', ''),
(12, 1, 'W', '', ''),
(12, 2, 'W', '', ''),
(12, 3, 'W', '', ''),
(12, 4, 'W', '', ''),
(12, 5, 'W', '', ''),
(12, 6, 'W', '', ''),
(12, 7, 'W', '', ''),
(12, 8, 'W', '', ''),
(12, 9, 'P', '', ''),
(12, 10, 'W', '', ''),
(12, 11, 'W', '', ''),
(12, 12, 'W', '', ''),
(12, 13, 'P', '', ''),
(13, 1, 'W', '', ''),
(13, 2, 'W', '', ''),
(13, 3, 'W', '', ''),
(13, 4, 'W', '', ''),
(13, 5, 'W', '', ''),
(13, 6, 'W', '', ''),
(13, 7, 'W', '', ''),
(13, 8, 'W', '', ''),
(13, 9, 'P', '', ''),
(13, 10, 'P', '', ''),
(13, 11, 'P', '', ''),
(13, 12, 'P', '', ''),
(13, 13, 'P', '', '');

-- --------------------------------------------------------

--
-- Δομή πίνακα για τον πίνακα `game_status`
--

CREATE TABLE `game_status` (
  `status` enum('not active','initialized','started','ended','aborded') NOT NULL DEFAULT 'not active',
  `p_turn` enum('R','P') DEFAULT NULL,
  `result` enum('R','P','D') DEFAULT NULL,
  `last_change` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Άδειασμα δεδομένων του πίνακα `game_status`
--

INSERT INTO `game_status` (`status`, `p_turn`, `result`, `last_change`) VALUES
('started', 'R', 'P', '2022-11-29 15:00:00');

-- --------------------------------------------------------

--
-- Δομή πίνακα για τον πίνακα `players`
--

CREATE TABLE `players` (
  `username` varchar(20) DEFAULT NULL,
  `piece_color` enum('P','R') NOT NULL,
  `token` varchar(100) DEFAULT NULL,
  `last_action` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Άδειασμα δεδομένων του πίνακα `players`
--

INSERT INTO `players` (`username`, `piece_color`, `token`, `last_action`) VALUES
('qqqqqq', 'P', '8599a2efe05697622caeddae84507ee3', '2022-11-29 15:00:01'),
('aaaa', 'R', '05da4297eecc648e840b6d3bfa772adc', '2022-11-29 15:00:02');

--
-- Ευρετήρια για άχρηστους πίνακες
--

--
-- Ευρετήρια για πίνακα `board`
--
ALTER TABLE `board`
  ADD PRIMARY KEY (`x`,`y`);

--
-- Ευρετήρια για πίνακα `board_empty`
--
ALTER TABLE `board_empty`
  ADD PRIMARY KEY (`x`,`y`);

--
-- Ευρετήρια για πίνακα `players`
--
ALTER TABLE `players`
  ADD PRIMARY KEY (`piece_color`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
